[X2DownloadableContentInfo_WOTCArchetypeNotCreatedEqual]
ATNCE_Description = "[ATNCE] Dynamically set weighted stat tiers and value ranges with random archetypes (heroes) – recruits feel distinct and dangerous."
ATNCE_Tooltip = "Soldiers are rolled into defined quality bands with weighted ranges and archetype flavours, so every rookie feels unique. Archetypes guide the distribution while keeping long‑war balance intact—expect gritty diversity without wild power spikes."
